src/resources/createOutputBeanGuiaPdf.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.engine.ck.com/">
   <soapenv:Header>
      <Usuario xmlns="uri:com.ck.engine.ws" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">$username</Usuario>
      <Password xmlns="uri:com.ck.engine.ws" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">$password</Password>
   </soapenv:Header>
   <soapenv:Body>
      <ws:requestOutputBean>
         <output>
            <direccion>
               <calle><![CDATA[$calle]]></calle>
               <colonia><![CDATA[$colonia]]></colonia>
               <cp><![CDATA[$cp]]></cp>
               <del_mun>DF</del_mun>
               <estado><![CDATA[$estado]]></estado>
               <nombreRecibe><![CDATA[$nombreRecibe]]></nombreRecibe>
               <numeroExt> </numeroExt>
               <numeroInt> </numeroInt>
               <referencias><![CDATA[$referencias]]></referencias>
               <telefonoContacto1><![CDATA[$telefonoContacto1]]></telefonoContacto1>
            </direccion>
            <idPedido><![CDATA[$idPedido]]></idPedido>
            <idTipoSalida>5</idTipoSalida>
$partidaList
            <fechaEntrega><![CDATA[$fechaEntrega]]></fechaEntrega>
            <cuenta><![CDATA[$accountId]]></cuenta>
            <guiaPdf><![CDATA[$label]]></guiaPdf>
            <guia><![CDATA[$trackingNumber]]></guia>
            <claveTransporte><![CDATA[$service]]></claveTransporte>
            <referenciaSalidaCliente><![CDATA[$customId]]></referenciaSalidaCliente>
            <salidaPrioridad><![CDATA[$priority]]></salidaPrioridad>
         </output>
      </ws:requestOutputBean>
   </soapenv:Body>
</soapenv:Envelope>
